# SQL Mini Project 

## Country Club Database: Tier 2 Part 2

In [1]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np

##### Create a database engine & list the tables within this database

In [2]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')
table_names = engine.table_names()
print(table_names)

['Bookings', 'Facilities', 'Members']

##### View each of the tables to ensure, everything looks as expected

In [3]:
df_bk = pd.read_sql_query('SELECT * FROM Bookings', engine)
print(df_bk.head())

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1

In [4]:
df_fc = pd.read_sql_query('SELECT * FROM Facilities', engine)
print(df_fc.head())

   facid             name  membercost  guestcost  initialoutlay  \
0      0   Tennis Court 1         5.0       25.0          10000
1      1   Tennis Court 2         5.0       25.0           8000
2      2  Badminton Court         0.0       15.5           4000
3      3     Table Tennis         0.0        5.0            320
4      4   Massage Room 1         9.9       80.0           4000

   monthlymaintenance
0                 200
1                 200
2                  50
3                  10
4                3000

In [5]:
df_mb = pd.read_sql_query('SELECT * FROM Members', engine)
print(df_mb.head())

   memid   surname firstname                       address  zipcode  \
0      0     GUEST     GUEST                         GUEST        0
1      1     Smith    Darren    8 Bloomsbury Close, Boston     4321
2      2     Smith     Tracy  8 Bloomsbury Close, New York     4321
3      3    Rownam       Tim        23 Highway Way, Boston    23423
4      4  Joplette    Janice    20 Crossing Road, New York      234

        telephone recommendedby             joindate
0  (000) 000-0000                2012-07-01 00:00:00
1    555-555-5555                2012-07-02 12:02:05
2    555-555-5555                2012-07-02 12:08:23
3  (844) 693-0723                2012-07-03 09:32:15
4  (833) 942-4710             1  2012-07-03 10:25:05

##### Now that everything looks as expected. Lets get back to the project questions.

##### First we merge the three tables into a single dataframe which can be used to answer subsequent questions.

In [6]:
bk_fc_mb = df_bk.merge(df_fc, on='facid', how='inner').merge(df_mb, on='memid', how='inner')
print(bk_fc_mb.columns)

Index(['bookid', 'facid', 'memid', 'starttime', 'slots', 'name', 'membercost',
       'guestcost', 'initialoutlay', 'monthlymaintenance', 'surname',
       'firstname', 'address', 'zipcode', 'telephone', 'recommendedby',
       'joindate'],
      dtype='object')

#### Q10. Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

In [7]:
# Select relevant columns from the merged dataframe
pb_10_df = bk_fc_mb.loc[:,['facid', 'name', 'memid', 'starttime', 'slots', 'membercost', 'guestcost']].copy()
print(pb_10_df.head())

   facid          name  memid            starttime  slots  membercost  \
0      3  Table Tennis      1  2012-07-03 11:00:00      2         0.0
1      3  Table Tennis      1  2012-07-05 19:00:00      2         0.0
2      3  Table Tennis      1  2012-07-06 11:00:00      2         0.0
3      3  Table Tennis      1  2012-07-08 11:30:00      2         0.0
4      3  Table Tennis      1  2012-07-08 19:30:00      2         0.0

   guestcost
0        5.0
1        5.0
2        5.0
3        5.0
4        5.0

In [8]:
# Add revenue column to the dataframe
pb_10_df['revenue'] = np.where(pb_10_df['memid']==0,pb_10_df['slots']*pb_10_df['guestcost'],pb_10_df['slots']*pb_10_df['membercost'])
print(pb_10_df.head())

   facid          name  memid            starttime  slots  membercost  \
0      3  Table Tennis      1  2012-07-03 11:00:00      2         0.0
1      3  Table Tennis      1  2012-07-05 19:00:00      2         0.0
2      3  Table Tennis      1  2012-07-06 11:00:00      2         0.0
3      3  Table Tennis      1  2012-07-08 11:30:00      2         0.0
4      3  Table Tennis      1  2012-07-08 19:30:00      2         0.0

   guestcost  revenue
0        5.0      0.0
1        5.0      0.0
2        5.0      0.0
3        5.0      0.0
4        5.0      0.0

In [9]:
# Verify revenue is as expected for members
pb_10_df[pb_10_df['memid']>0]

,facid,name,memid,starttime,slots,membercost,guestcost,revenue
0,3,Table Tennis,1,2012-07-03 11:00:00,2,0.0,5.0,0.0
1,3,Table Tennis,1,2012-07-05 19:00:00,2,0.0,5.0,0.0
2,3,Table Tennis,1,2012-07-06 11:00:00,2,0.0,5.0,0.0
3,3,Table Tennis,1,2012-07-08 11:30:00,2,0.0,5.0,0.0
4,3,Table Tennis,1,2012-07-08 19:30:00,2,0.0,5.0,0.0
...,...,...,...,...,...,...,...,...
4038,7,Snooker Table,27,2012-09-30 08:30:00,2,0.0,5.0,0.0
4039,8,Pool Table,27,2012-09-16 13:30:00,1,0.0,5.0,0.0
4040,8,Pool Table,27,2012-09-16 15:30:00,1,0.0,5.0,0.0
4041,8,Pool Table,27,2012-09-27 18:00:00,1,0.0,5.0,0.0
4042,1,Tennis Court 2,27,2012-09-21 18:00:00,3,5.0,25.0,15.0

In [10]:
# Verify revenue is as expected for guests
pb_10_df[pb_10_df['memid']==0]

,facid,name,memid,starttime,slots,membercost,guestcost,revenue
879,3,Table Tennis,0,2012-07-26 09:00:00,2,0.0,5.0,10.0
880,3,Table Tennis,0,2012-07-26 13:30:00,2,0.0,5.0,10.0
881,3,Table Tennis,0,2012-07-27 10:30:00,2,0.0,5.0,10.0
882,3,Table Tennis,0,2012-08-08 12:00:00,2,0.0,5.0,10.0
883,3,Table Tennis,0,2012-08-25 12:00:00,2,0.0,5.0,10.0
...,...,...,...,...,...,...,...,...
1757,5,Massage Room 2,0,2012-09-28 13:00:00,2,9.9,80.0,160.0
1758,5,Massage Room 2,0,2012-09-28 17:00:00,4,9.9,80.0,320.0
1759,5,Massage Room 2,0,2012-09-29 12:30:00,2,9.9,80.0,160.0
1760,5,Massage Room 2,0,2012-09-30 11:30:00,2,9.9,80.0,160.0
1761,5,Massage Room 2,0,2012-09-30 19:30:00,2,9.9,80.0,160.0

In [11]:
# Finally compute revenue for each facility
rev_group = pb_10_df.groupby('name')['revenue'].sum()

In [12]:
# Print groups for which revenue is less than $1000
print(rev_group[rev_group < 1000].sort_values())

name
Table Tennis     180.0
Snooker Table    240.0
Pool Table       270.0
Name: revenue, dtype: float64

#### Q11. Produce a report of members and who recommended them in alphabetic surname, firstname order

In [13]:
# In order to answer this, we perform a self-join of the members dataframe with itself.
df_mb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   memid          31 non-null     int64
 1   surname        31 non-null     object
 2   firstname      31 non-null     object
 3   address        31 non-null     object
 4   zipcode        31 non-null     int64
 5   telephone      31 non-null     object
 6   recommendedby  31 non-null     object
 7   joindate       31 non-null     object
dtypes: int64(2), object(6)
memory usage: 2.1+ KB

In [14]:
# However we observe that 'memid' and 'recommendedby' the two ids needed for self-join do not have the same type.
# First we make these two columns have the same type
df_mb['recommendedby'] = pd.to_numeric(df_mb['recommendedby'], errors='coerce')
df_mb['recommendedby'].fillna(9999999, inplace=True)
df_mb['recommendedby']= df_mb['recommendedby'].astype(int)
df_mb['memid'] = df_mb['memid'].astype(int)
df_mb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   memid          31 non-null     int32
 1   surname        31 non-null     object
 2   firstname      31 non-null     object
 3   address        31 non-null     object
 4   zipcode        31 non-null     int64
 5   telephone      31 non-null     object
 6   recommendedby  31 non-null     int32
 7   joindate       31 non-null     object
dtypes: int32(2), int64(1), object(5)
memory usage: 1.8+ KB

In [15]:
# Now that the two columns have same type, we self-join as follows:
pb_11_ini_df = df_mb.merge(df_mb, left_on='recommendedby', right_on='memid', suffixes=('_org','_rec'))

# Final answer is expected in 'lastname firstname' format for both members and recommenders
pb_11_ini_df['member_name'] = pb_11_ini_df['surname_org'] + ' ' + pb_11_ini_df['firstname_org']
pb_11_ini_df['recommender_name'] = pb_11_ini_df['surname_rec'] + ' ' + pb_11_ini_df['firstname_rec']

pb_11_df = pb_11_ini_df.loc[:,['member_name','recommender_name']].copy()
pb_11_df.sort_values('member_name')

                member_name   recommender_name
10           Bader Florence    Stibbons Ponder
9                Baker Anne    Stibbons Ponder
11            Baker Timothy     Farrell Jemima
7                Boothe Tim         Rownam Tim
1            Butters Gerald       Smith Darren
14              Coplin Joan      Baker Timothy
20            Crumpet Erica        Smith Tracy
5                Dare Nancy    Joplette Janice
13          Genting Matthew     Butters Gerald
21                Hunt John  Purview Millicent
6               Jones David    Joplette Janice
16            Jones Douglas        Jones David
0           Joplette Janice       Smith Darren
4            Mackenzie Anna       Smith Darren
2              Owen Charles       Smith Darren
12             Pinker David     Farrell Jemima
19        Purview Millicent        Smith Tracy
17         Rumney Henrietta    Genting Matthew
15         Sarwin Ramnaresh     Bader Florence
3                Smith Jack       Smith Darren
8           Stibbons Ponder       Tracy Burton
18  Worthington-Smyth Henry        Smith Tracy

#### Q12. Find the facilities with their usage by member, but not guests

In [16]:
# Guests have member id 0. Members have id > 0
pb_12_ini_df = bk_fc_mb[bk_fc_mb['memid']>0].loc[:,['facid', 'name', 'memid', 'slots']]

pb_12_ini_df.head()

   facid          name  memid  slots
0      3  Table Tennis      1      2
1      3  Table Tennis      1      2
2      3  Table Tennis      1      2
3      3  Table Tennis      1      2
4      3  Table Tennis      1      2

In [17]:
# Calculate total usage of the facility by members in days
pb_12_interm = pb_12_ini_df.groupby(['facid','name'])['slots'].sum()/48.0
# Sort in ascending order of usage
pb_12_df = pb_12_interm.sort_values()
pb_12_df

facid  name
5      Massage Room 2      1.125000
6      Squash Court        8.708333
3      Table Tennis       16.541667
8      Pool Table         17.833333
7      Snooker Table      17.916667
1      Tennis Court 2     18.375000
4      Massage Room 1     18.416667
0      Tennis Court 1     19.937500
2      Badminton Court    22.625000
Name: slots, dtype: float64

#### Q13. Find the facilities usage by month, but not guests

In [18]:
# Guests have member id 0. Members have id > 0
pb_13_ini_df = bk_fc_mb[bk_fc_mb['memid']>0].loc[:,['facid', 'name', 'memid', 'starttime', 'slots']]
pb_13_ini_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3160 entries, 0 to 4042
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   facid      3160 non-null   int64
 1   name       3160 non-null   object
 2   memid      3160 non-null   int64
 3   starttime  3160 non-null   object
 4   slots      3160 non-null   int64
dtypes: int64(3), object(2)
memory usage: 148.1+ KB

In [19]:
# In order to compute facility usage by month, we need a months column that can be generated from the starttime column
pb_13_ini_df['month'] = pd.DatetimeIndex(pb_13_ini_df['starttime']).month
pb_13_ini_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3160 entries, 0 to 4042
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   facid      3160 non-null   int64
 1   name       3160 non-null   object
 2   memid      3160 non-null   int64
 3   starttime  3160 non-null   object
 4   slots      3160 non-null   int64
 5   month      3160 non-null   int64
dtypes: int64(4), object(2)
memory usage: 172.8+ KB

In [20]:
# Calculate total monthly usage of the facility by members in number of slots
pb_13_interm = pb_13_ini_df.groupby(['facid','name', 'month'])['slots'].sum()
# Sort in ascending order of facility index
pb_13_df = pb_13_interm.sort_index()
pb_13_df

facid  name             month
0      Tennis Court 1   7        201
                        8        339
                        9        417
1      Tennis Court 2   7        123
                        8        345
                        9        414
2      Badminton Court  7        165
                        8        414
                        9        507
3      Table Tennis     7         98
                        8        296
                        9        400
4      Massage Room 1   7        166
                        8        316
                        9        402
5      Massage Room 2   7          8
                        8         18
                        9         28
6      Squash Court     7         50
                        8        184
                        9        184
7      Snooker Table    7        140
                        8        316
                        9        404
8      Pool Table       7        110
                        8        303
                        9        443
Name: slots, dtype: int64